TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыВзвешивания/гкс_ТипыВзвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыВзвешивания</name>
  <enumValues>
    <name>Въезд</name>
  </enumValues>
  <enumValues>
    <name>Выезд</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Взвешивание/гкс_Взвешивание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Взвешивание</name>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеСтабилен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтправки</name>
    <comment>WagonDispatchID</comment>
    <type>
      <types>CatalogRef.гкс_КлючиАналитикиСРПВ</types>
    </type>
  </attributes>
  <attributes>
    <name>КачествоНеПринято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВесов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВзвешивания</name>
    <type>
      <types>EnumRef.гкс_ТипыВзвешивания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_АвтоматическоеВзвешивание/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПровестиВзвешивание(РегистрацияНаПЛК, Весы, ДокументВзвешивание) Экспорт
	
	Если РегистрыСведений.гкс_СостоянияРегистрации.УжеУбыл(РегистрацияНаПЛК) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Машина по документу %1 уже убыла!';"), РегистрацияНаПЛК);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, РегистрацияНаПЛК.Метаданные(), РегистрацияНаПЛК, ТекстСообщения);
		Возврат;
	КонецЕсли;

	МаксимальноеКоличествоОпросов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "МаксимальноеКоличествоОпросов");
		
	МассивПоказаний = гкс_ОбменДаннымиСВесами.РезультатыВзвешивания(
		XMLСтрока(РегистрацияНаПЛК), Весы, МаксимальноеКоличествоОпросов, Истина);
			
	Если ЗначениеЗаполнено(МассивПоказаний) Тогда
			
		ВесВДокументе = ВесВДокументе(РегистрацияНаПЛК, Весы);
		ВесФактический = ФактическийВес(МассивПоказаний, ВесВДокументе);
		
		Если ВесФактический.Вес = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Получен нулевой вес!'");
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, РегистрацияНаПЛК.Метаданные(), РегистрацияНаПЛК, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
		ДокументВзвешивание = Документы.гкс_Взвешивание.ПоРегистрацииИТипуВзвешивания(РегистрацияНаПЛК, ТипВзвешивания);
		
		ДанныеЗаполнения = ДанныеЗаполненияВзвешивание(РегистрацияНаПЛК, Весы, ВесФактический);
		ЗаполнитьДокументВзвешивание(ДокументВзвешивание, ДанныеЗаполнения); 
	КонецЕсли;	
	
КонецПроцедуры

// Метод формирует коллекцию с данными для заполнения документа взвешивания.
// 
// Параметры:
//  РегистрацияНаПЛК - ДокументСсылка.гкс_РегистрацияНаПЛК - Регистрация на ПЛК
//  Весы - СправочникСсылка.гкс_ОборудованиеПЛК - Весы
//  ДанныеВзвешивания - Структура - Данные взвешивания:
//  					* Вес - Число 
// 						* ВесНеСтабилен - Булево
// 
// Возвращаемое значение:
//  Структура - Данные заполнения взвешивание:
// * Организация - СправочникСсылка.Организации
// * ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// * ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации
// * Весы - СправочникСсылка.гкс_ОборудованиеПЛК
// * ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК 
// * Вес - Число
// * ВесНеСтабилен - Булево 
// * ВесВведенВручную - Булево 
// * Дата - Дата 
// * МестнаяДата - Дата 
// * ТипВзвешивания - ПеречислениеСсылка.гкс_ТипыВзвешивания 
Функция ДанныеЗаполненияВзвешивание(РегистрацияНаПЛК, Весы, ДанныеВзвешивания) Экспорт
	
	ДанныеЗаполненния = Новый Структура("Организация,ТочкаМаршрута,ТипРегистрации");
	
	ДанныеЗаполненния.Вставить("Весы", Весы);
	ДанныеЗаполненния.Вставить("ДокументРегистрации", РегистрацияНаПЛК);
	ДанныеЗаполненния.Вставить("Вес", ДанныеВзвешивания.Вес);
	ДанныеЗаполненния.Вставить("ВесНеСтабилен", ДанныеВзвешивания.ВесНеСтабилен);
	ДанныеЗаполненния.Вставить("ВесВведенВручную", Ложь);
	ДанныеЗаполненния.Вставить("Дата", ТекущаяДатаСеанса());
	ДанныеЗаполненния.Вставить("МестнаяДата", ДанныеЗаполненния.Дата);
	
	ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
	ДанныеЗаполненния.Вставить("ТипВзвешивания", ТипВзвешивания);

	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РегистрацияНаПЛК, 
						"ТипРегистрации, Организация, ТочкаМаршрута");
							
	ЗаполнитьЗначенияСвойств(ДанныеЗаполненния, ДанныеРегистрации);
	
	Возврат ДанныеЗаполненния;
	
КонецФункции

Процедура ЗаполнитьДокументВзвешивание(ДокументВзвешивание, ДанныеЗаполнения) Экспорт

	Если Не ЗначениеЗаполнено(ДокументВзвешивание) Тогда
		ДокументВзвешивание = Документы.гкс_Взвешивание.СформироватьДокумент(ДанныеЗаполнения);
	Иначе
		ВзвешиваниеОбъект = ДокументВзвешивание.ПолучитьОбъект(); 
		ВзвешиваниеОбъект.Заполнить(ДанныеЗаполнения);
		ВзвешиваниеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФактическийВес(МассивПоказаний, ВесВДокументе)
	
	ТаблицаИзмерений = Новый ТаблицаЗначений();
	ТаблицаИзмерений.Колонки.Добавить("Вес");
	ТаблицаИзмерений.Колонки.Добавить("Отклонение");
	ТаблицаИзмерений.Колонки.Добавить("ВесНеСтабилен");
	
	Степень = 2;
	Для Каждого ЭлементМассива Из МассивПоказаний Цикл 
		СтрокаТаблицы = ТаблицаИзмерений.Добавить();
		СтрокаТаблицы.Вес 			= ЭлементМассива.Вес;
		СтрокаТаблицы.ВесНеСтабилен	= ЭлементМассива.ВесНеСтабилен;
		СтрокаТаблицы.Отклонение 	= Pow(СтрокаТаблицы.Вес - ВесВДокументе, Степень);
	КонецЦикла;	
	
	ТаблицаИзмерений.Сортировать("Отклонение");
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаИзмерений[0]);
	
КонецФункции

Функция ВесВДокументе(РегистрацияНаПЛК, Весы)
	
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		РегистрацияНаПЛК, "ТипРегистрации, ВесБрутто, ВесНетто");
	
	ТипВзвешивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Весы, "ТипВзвешивания");
	
	Если ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
			ВесВДокументе = ДанныеРегистрации.ВесБрутто;
		Иначе	
			ВесВДокументе = ДанныеРегистрации.ВесНетто;
		КонецЕсли;
		
	ИначеЕсли ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка Тогда
		Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
			ВесВДокументе = ДанныеРегистрации.ВесНетто;
		Иначе	
			ВесВДокументе = ДанныеРегистрации.ВесБрутто;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВесВДокументе;
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	Возврат "Кверион. Автоматическое взвешивание";
КонецФункции

#КонецОбласти
